Creates a three-dimensional rectangular box.
  Namespace:   Autodesk.Revit.Creation
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public BoundingBoxXYZ NewBoundingBoxXYZ()
  Visual Basic
Public Function NewBoundingBoxXYZ As BoundingBoxXYZ
  Visual C++
public:
BoundingBoxXYZ^ NewBoundingBoxXYZ()
 See Also
  Application Class
  Autodesk.Revit.Creation Namespace